mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xj/common/s6e2g2xj.h
typedef struct stc_gpio_epfr26_field
{
    union {
        struct {
            __IO  uint32_t  Q_SCKB               :2;
            __IO  uint32_t  Q_CS0E               :2;
            __IO  uint32_t  Q_CS1E               :2;
            __IO  uint32_t  Q_CS2E               :2;
            __IO  uint32_t  Q_CS3E               :2;
            __IO  uint32_t  Q_IO0B               :2;
            __IO  uint32_t  Q_IO1B               :2;
            __IO  uint32_t  Q_IO2B               :2;
            __IO  uint32_t  Q_IO3B               :2;
            __IO  uint32_t  RESERVED0            :14;
        };
        struct {
            __IO  uint32_t  Q_SCKB0              :1;
            __IO  uint32_t  Q_SCKB1              :1;
            __IO  uint32_t  Q_CS0E0              :1;
            __IO  uint32_t  Q_CS0E1              :1;
            __IO  uint32_t  Q_CS1E0              :1;
            __IO  uint32_t  Q_CS1E1              :1;
            __IO  uint32_t  Q_CS2E0              :1;
            __IO  uint32_t  Q_CS2E1              :1;
            __IO  uint32_t  Q_CS3E0              :1;
            __IO  uint32_t  Q_CS3E1              :1;
            __IO  uint32_t  Q_IO0B0              :1;
            __IO  uint32_t  Q_IO0B1              :1;
            __IO  uint32_t  Q_IO1B0              :1;
            __IO  uint32_t  Q_IO1B1              :1;
            __IO  uint32_t  Q_IO2B0              :1;
            __IO  uint32_t  Q_IO2B1              :1;
            __IO  uint32_t  Q_IO3B0              :1;
            __IO  uint32_t  Q_IO3B1              :1;
            __IO  uint32_t  RESERVED1            :14;
        };
    };
} stc_gpio_epfr26_field_t;

typedef struct stc_gpio_epfr33_field
{
    union {
        struct {
            __IO  uint32_t  CIN0S                :2;
            __IO  uint32_t  DATA0B               :2;
            __IO  uint32_t  RST0E                :2;
            __IO  uint32_t  VPEN0E               :2;
            __IO  uint32_t  VCC0E                :2;
            __IO  uint32_t  CLK0E                :2;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  CIN1S                :2;
            __IO  uint32_t  DATA1B               :2;
            __IO  uint32_t  RST1E                :2;
            __IO  uint32_t  VPEN1E               :2;
            __IO  uint32_t  VCC1E                :2;
            __IO  uint32_t  CLK1E                :2;
            __IO  uint32_t  RESERVED2            :4;
        };
        struct {
            __IO  uint32_t  CIN0S0               :1;
            __IO  uint32_t  CIN0S1               :1;
            __IO  uint32_t  DATA0B0              :1;
            __IO  uint32_t  DATA0B1              :1;
            __IO  uint32_t  RST0E0               :1;
            __IO  uint32_t  RST0E1               :1;
            __IO  uint32_t  VPEN0E0              :1;
            __IO  uint32_t  VPEN0E1              :1;
            __IO  uint32_t  VCC0E0               :1;
            __IO  uint32_t  VCC0E1               :1;
            __IO  uint32_t  CLK0E0               :1;
            __IO  uint32_t  CLK0E1               :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  CIN1S0               :1;
            __IO  uint32_t  CIN1S1               :1;
            __IO  uint32_t  DATA1B0              :1;
            __IO  uint32_t  DATA1B1              :1;
            __IO  uint32_t  RST1E0               :1;
            __IO  uint32_t  RST1E1               :1;
            __IO  uint32_t  VPEN1E0              :1;
            __IO  uint32_t  VPEN1E1              :1;
            __IO  uint32_t  VCC1E0               :1;
            __IO  uint32_t  VCC1E1               :1;
            __IO  uint32_t  CLK1E0               :1;
            __IO  uint32_t  CLK1E1               :1;
            __IO  uint32_t  RESERVED3            :4;
        };
    };
} stc_gpio_epfr33_field_t;

typedef struct stc_gpio_epfr35_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :16;
            __IO  uint32_t  MCK1S                :2;
            __IO  uint32_t  MCK1E                :2;
            __IO  uint32_t  SCK1B                :2;
            __IO  uint32_t  WS1B                 :2;
            __IO  uint32_t  SDI1S                :2;
            __IO  uint32_t  SDO1E                :2;
            __IO  uint32_t  RESERVED2            :4;
        };
        struct {
            __IO  uint32_t  RESERVED1            :16;
            __IO  uint32_t  MCK1S0               :1;
            __IO  uint32_t  MCK1S1               :1;
            __IO  uint32_t  MCK1E0               :1;
            __IO  uint32_t  MCK1E1               :1;
            __IO  uint32_t  SCK1B0               :1;
            __IO  uint32_t  SCK1B1               :1;
            __IO  uint32_t  WS1B0                :1;
            __IO  uint32_t  WS1B1                :1;
            __IO  uint32_t  SDI1S0               :1;
            __IO  uint32_t  SDI1S1               :1;
            __IO  uint32_t  SDO1E0               :1;
            __IO  uint32_t  SDO1E1               :1;
            __IO  uint32_t  RESERVED3            :4;
        };
    };
} stc_gpio_epfr35_field_t;

typedef struct stc_gpio_pzr0_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  RESERVED0                :3;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  RESERVED1                :21;
} stc_gpio_pzr0_field_t;

typedef struct stc_gpio_pzr1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_gpio_pzr1_field_t;

typedef struct stc_gpio_pzr2_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  RESERVED0                :21;
} stc_gpio_pzr2_field_t;

typedef struct stc_gpio_pzr3_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED0                :17;
} stc_gpio_pzr3_field_t;

