mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xj/common/s6e2g2xj.h
/*******************************************************************************
* SBSSR_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[252];
    union {
        __IO uint16_t BTSSSR;
        stc_sbssr_btsssr_field_t BTSSSR_f;
        struct {
            __IO  uint8_t BTSSSRL;
            __IO  uint8_t BTSSSRH;
        };
    };
} FM_SBSSR_TypeDef, FM4_SBSSR_TypeDef;

/*******************************************************************************
* SMCIF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t GLOBALCONTROL1;
        stc_smcif_globalcontrol1_field_t GLOBALCONTROL1_f;
        struct {
            __IO  uint8_t GLOBALCONTROL1L;
            __IO  uint8_t GLOBALCONTROL1H;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t STATUS;
        stc_smcif_status_field_t STATUS_f;
        struct {
            __IO  uint8_t STATUSL;
            __IO  uint8_t STATUSH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint16_t PORTCONTROL;
        stc_smcif_portcontrol_field_t PORTCONTROL_f;
        struct {
            __IO  uint8_t PORTCONTROLL;
            __IO  uint8_t PORTCONTROLH;
        };
    };
        __IO  uint8_t RESERVED2[2];
    union {
        __IO uint16_t DATA;
        stc_smcif_data_field_t DATA_f;
        struct {
            __IO  uint8_t DATAL;
            __IO  uint8_t DATAH;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t CARDCLOCK;
        stc_smcif_cardclock_field_t CARDCLOCK_f;
        struct {
            __IO  uint8_t CARDCLOCKL;
            __IO  uint8_t CARDCLOCKH;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO uint16_t BAUDRATE;
        stc_smcif_baudrate_field_t BAUDRATE_f;
        struct {
            __IO  uint8_t BAUDRATEL;
            __IO  uint8_t BAUDRATEH;
        };
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO uint16_t GUARDTIMER;
        stc_smcif_guardtimer_field_t GUARDTIMER_f;
        struct {
            __IO  uint8_t GUARDTIMERL;
            __IO  uint8_t GUARDTIMERH;
        };
    };
        __IO  uint8_t RESERVED6[2];
    union {
        __IO uint16_t IDLETIMER;
        stc_smcif_idletimer_field_t IDLETIMER_f;
        struct {
            __IO  uint8_t IDLETIMERL;
            __IO  uint8_t IDLETIMERH;
        };
    };
        __IO  uint8_t RESERVED7[2];
    union {
        __IO uint16_t GLOBALCONTROL2;
        stc_smcif_globalcontrol2_field_t GLOBALCONTROL2_f;
        struct {
            __IO  uint8_t GLOBALCONTROL2L;
            __IO  uint8_t GLOBALCONTROL2H;
        };
    };
        __IO  uint8_t RESERVED8[2];
    union {
        __IO uint16_t DATA_FIFO;
        stc_smcif_data_fifo_field_t DATA_FIFO_f;
        struct {
            __IO  uint8_t DATA_FIFOL;
            __IO  uint8_t DATA_FIFOH;
        };
    };
        __IO  uint8_t RESERVED9[2];
    union {
        __IO uint16_t FIFO_LEVEL_READ;
        stc_smcif_fifo_level_read_field_t FIFO_LEVEL_READ_f;
        struct {
            __IO  uint8_t FIFO_LEVEL_READL;
            __IO  uint8_t FIFO_LEVEL_READH;
        };
    };
        __IO  uint8_t RESERVED10[2];
    union {
        __IO uint16_t FIFO_LEVEL_WRITE;
        stc_smcif_fifo_level_write_field_t FIFO_LEVEL_WRITE_f;
        struct {
            __IO  uint8_t FIFO_LEVEL_WRITEL;
            __IO  uint8_t FIFO_LEVEL_WRITEH;
        };
    };
        __IO  uint8_t RESERVED11[2];
    union {
        __IO uint16_t FIFO_MODE;
        stc_smcif_fifo_mode_field_t FIFO_MODE_f;
        struct {
            __IO  uint8_t FIFO_MODEL;
            __IO  uint8_t FIFO_MODEH;
        };
    };
        __IO  uint8_t RESERVED12[2];
    union {
        __IO uint16_t FIFO_CLEAR_MSB_WRITE;
        stc_smcif_fifo_clear_msb_write_field_t FIFO_CLEAR_MSB_WRITE_f;
        struct {
            __IO  uint8_t FIFO_CLEAR_MSB_WRITEL;
            __IO  uint8_t FIFO_CLEAR_MSB_WRITEH;
        };
    };
        __IO  uint8_t RESERVED13[2];
    union {
        __IO uint16_t FIFO_CLEAR_MSB_READ;
        stc_smcif_fifo_clear_msb_read_field_t FIFO_CLEAR_MSB_READ_f;
        struct {
            __IO  uint8_t FIFO_CLEAR_MSB_READL;
            __IO  uint8_t FIFO_CLEAR_MSB_READH;
        };
    };
        __IO  uint8_t RESERVED14[6];
    union {
        __IO uint16_t IRQ_STATUS;
        stc_smcif_irq_status_field_t IRQ_STATUS_f;
        struct {
            __IO  uint8_t IRQ_STATUSL;
            __IO  uint8_t IRQ_STATUSH;
        };
    };
} FM_SMCIF_TypeDef, FM4_SMCIF_TypeDef;

/*******************************************************************************
* SWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDOGLOAD;
        struct {
          union {
            __IO uint16_t WDOGLOADL;
            struct {
              __IO uint8_t WDOGLOADLL;
              __IO uint8_t WDOGLOADLH;
            };
          };
          union {
            __IO uint16_t WDOGLOADH;
            struct {
              __IO uint8_t WDOGLOADHL;
              __IO uint8_t WDOGLOADHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGVALUE;
        struct {
          union {
            __IO uint16_t WDOGVALUEL;
            struct {
              __IO uint8_t WDOGVALUELL;
              __IO uint8_t WDOGVALUELH;
            };
          };
          union {
            __IO uint16_t WDOGVALUEH;
            struct {
              __IO uint8_t WDOGVALUEHL;
              __IO uint8_t WDOGVALUEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGCONTROL;
        stc_swwdt_wdogcontrol_field_t WDOGCONTROL_f;
        struct {
          union {
            __IO uint16_t WDOGCONTROLL;
            struct {
              __IO uint8_t WDOGCONTROLLL;
              __IO uint8_t WDOGCONTROLLH;
            };
          };
          union {
            __IO uint16_t WDOGCONTROLH;
            struct {
              __IO uint8_t WDOGCONTROLHL;
              __IO uint8_t WDOGCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGINTCLR;
        struct {
          union {
            __IO uint16_t WDOGINTCLRL;
            struct {
              __IO uint8_t WDOGINTCLRLL;
              __IO uint8_t WDOGINTCLRLH;
            };
          };
          union {
            __IO uint16_t WDOGINTCLRH;
            struct {
              __IO uint8_t WDOGINTCLRHL;
              __IO uint8_t WDOGINTCLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGRIS;
        stc_swwdt_wdogris_field_t WDOGRIS_f;
        struct {
          union {
            __IO uint16_t WDOGRISL;
            struct {
              __IO uint8_t WDOGRISLL;
              __IO uint8_t WDOGRISLH;
            };
          };
          union {
            __IO uint16_t WDOGRISH;
            struct {
              __IO uint8_t WDOGRISHL;
              __IO uint8_t WDOGRISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t WDOGSPMC;
        stc_swwdt_wdogspmc_field_t WDOGSPMC_f;
        struct {
          union {
            __IO uint16_t WDOGSPMCL;
            struct {
              __IO uint8_t WDOGSPMCLL;
              __IO uint8_t WDOGSPMCLH;
            };
          };
          union {
            __IO uint16_t WDOGSPMCH;
            struct {
              __IO uint8_t WDOGSPMCHL;
              __IO uint8_t WDOGSPMCHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[3044];
    union {
        __IO uint32_t WDOGLOCK;
        struct {
          union {
            __IO uint16_t WDOGLOCKL;
            struct {
              __IO uint8_t WDOGLOCKLL;
              __IO uint8_t WDOGLOCKLH;
            };
          };
          union {
            __IO uint16_t WDOGLOCKH;
            struct {
              __IO uint8_t WDOGLOCKHL;
              __IO uint8_t WDOGLOCKHH;
            };
          };
        };
    };
} FM_SWWDT_TypeDef, FM4_SWWDT_TypeDef;

