mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xj/common/s6e2g2xj.h
#define FM4_DSTC_DREQENB0_AVAILABLE               1
#define FM_DSTC_DREQENB0_AVAILABLE                1
#define FM4_DSTC_DREQENB1_AVAILABLE               1
#define FM_DSTC_DREQENB1_AVAILABLE                1
#define FM4_DSTC_DREQENB2_AVAILABLE               1
#define FM_DSTC_DREQENB2_AVAILABLE                1
#define FM4_DSTC_DREQENB3_AVAILABLE               1
#define FM_DSTC_DREQENB3_AVAILABLE                1
#define FM4_DSTC_DREQENB4_AVAILABLE               1
#define FM_DSTC_DREQENB4_AVAILABLE                1
#define FM4_DSTC_DREQENB5_AVAILABLE               1
#define FM_DSTC_DREQENB5_AVAILABLE                1
#define FM4_DSTC_DREQENB6_AVAILABLE               1
#define FM_DSTC_DREQENB6_AVAILABLE                1
#define FM4_DSTC_DREQENB7_AVAILABLE               1
#define FM_DSTC_DREQENB7_AVAILABLE                1
#define FM4_DSTC_HWDESP_AVAILABLE                 1
#define FM_DSTC_HWDESP_AVAILABLE                  1
#define FM4_DSTC_HWINT0_AVAILABLE                 1
#define FM_DSTC_HWINT0_AVAILABLE                  1
#define FM4_DSTC_HWINT1_AVAILABLE                 1
#define FM_DSTC_HWINT1_AVAILABLE                  1
#define FM4_DSTC_HWINT2_AVAILABLE                 1
#define FM_DSTC_HWINT2_AVAILABLE                  1
#define FM4_DSTC_HWINT3_AVAILABLE                 1
#define FM_DSTC_HWINT3_AVAILABLE                  1
#define FM4_DSTC_HWINT4_AVAILABLE                 1
#define FM_DSTC_HWINT4_AVAILABLE                  1
#define FM4_DSTC_HWINT5_AVAILABLE                 1
#define FM_DSTC_HWINT5_AVAILABLE                  1
#define FM4_DSTC_HWINT6_AVAILABLE                 1
#define FM_DSTC_HWINT6_AVAILABLE                  1
#define FM4_DSTC_HWINT7_AVAILABLE                 1
#define FM_DSTC_HWINT7_AVAILABLE                  1
#define FM4_DSTC_HWINTCLR0_AVAILABLE              1
#define FM_DSTC_HWINTCLR0_AVAILABLE               1
#define FM4_DSTC_HWINTCLR1_AVAILABLE              1
#define FM_DSTC_HWINTCLR1_AVAILABLE               1
#define FM4_DSTC_HWINTCLR2_AVAILABLE              1
#define FM_DSTC_HWINTCLR2_AVAILABLE               1
#define FM4_DSTC_HWINTCLR3_AVAILABLE              1
#define FM_DSTC_HWINTCLR3_AVAILABLE               1
#define FM4_DSTC_HWINTCLR4_AVAILABLE              1
#define FM_DSTC_HWINTCLR4_AVAILABLE               1
#define FM4_DSTC_HWINTCLR5_AVAILABLE              1
#define FM_DSTC_HWINTCLR5_AVAILABLE               1
#define FM4_DSTC_HWINTCLR6_AVAILABLE              1
#define FM_DSTC_HWINTCLR6_AVAILABLE               1
#define FM4_DSTC_HWINTCLR7_AVAILABLE              1
#define FM_DSTC_HWINTCLR7_AVAILABLE               1
#define FM4_DSTC_MONERS_AVAILABLE                 1
#define FM_DSTC_MONERS_AVAILABLE                  1
#define FM4_DSTC_SWTR_AVAILABLE                   1
#define FM_DSTC_SWTR_AVAILABLE                    1
/*******************************************************************************
* DT
*******************************************************************************/
#define FM4_DT_TIMER1BGLOAD_AVAILABLE             1
#define FM_DT_TIMER1BGLOAD_AVAILABLE              1
#define FM4_DT_TIMER1CONTROL_AVAILABLE            1
#define FM_DT_TIMER1CONTROL_AVAILABLE             1
#define FM4_DT_TIMER1INTCLR_AVAILABLE             1
#define FM_DT_TIMER1INTCLR_AVAILABLE              1
#define FM4_DT_TIMER1LOAD_AVAILABLE               1
#define FM_DT_TIMER1LOAD_AVAILABLE                1
#define FM4_DT_TIMER1MIS_AVAILABLE                1
#define FM_DT_TIMER1MIS_AVAILABLE                 1
#define FM4_DT_TIMER1RIS_AVAILABLE                1
#define FM_DT_TIMER1RIS_AVAILABLE                 1
#define FM4_DT_TIMER1VALUE_AVAILABLE              1
#define FM_DT_TIMER1VALUE_AVAILABLE               1
#define FM4_DT_TIMER2BGLOAD_AVAILABLE             1
#define FM_DT_TIMER2BGLOAD_AVAILABLE              1
#define FM4_DT_TIMER2CONTROL_AVAILABLE            1
#define FM_DT_TIMER2CONTROL_AVAILABLE             1
#define FM4_DT_TIMER2INTCLR_AVAILABLE             1
#define FM_DT_TIMER2INTCLR_AVAILABLE              1
#define FM4_DT_TIMER2LOAD_AVAILABLE               1
#define FM_DT_TIMER2LOAD_AVAILABLE                1
#define FM4_DT_TIMER2MIS_AVAILABLE                1
#define FM_DT_TIMER2MIS_AVAILABLE                 1
#define FM4_DT_TIMER2RIS_AVAILABLE                1
#define FM_DT_TIMER2RIS_AVAILABLE                 1
#define FM4_DT_TIMER2VALUE_AVAILABLE              1
#define FM_DT_TIMER2VALUE_AVAILABLE               1
/*******************************************************************************
* ECC_CAPTURE
*******************************************************************************/
#define FM4_ECC_CAPTURE_FERRAD_AVAILABLE          1
#define FM_ECC_CAPTURE_FERRAD_AVAILABLE           1
/*******************************************************************************
* ETHERNET_CONTROL
*******************************************************************************/
#define FM4_ETHERNET_CONTROL_ETH_CLKG_AVAILABLE   1
#define FM_ETHERNET_CONTROL_ETH_CLKG_AVAILABLE    1
#define FM4_ETHERNET_CONTROL_ETH_MODE_AVAILABLE   1
#define FM_ETHERNET_CONTROL_ETH_MODE_AVAILABLE    1
/*******************************************************************************
* ETHERNET_MAC0
*******************************************************************************/
#define FM4_ETHERNET_MAC_AHBSR_AVAILABLE          1
#define FM_ETHERNET_MAC_AHBSR_AVAILABLE           1
#define FM4_ETHERNET_MAC_ATNR_AVAILABLE           1
#define FM_ETHERNET_MAC_ATNR_AVAILABLE            1
#define FM4_ETHERNET_MAC_ATSR_AVAILABLE           1
#define FM_ETHERNET_MAC_ATSR_AVAILABLE            1
#define FM4_ETHERNET_MAC_BMR_AVAILABLE            1
#define FM_ETHERNET_MAC_BMR_AVAILABLE             1
#define FM4_ETHERNET_MAC_CHRBAR_AVAILABLE         1
#define FM_ETHERNET_MAC_CHRBAR_AVAILABLE          1
#define FM4_ETHERNET_MAC_CHRDR_AVAILABLE          1
#define FM_ETHERNET_MAC_CHRDR_AVAILABLE           1
#define FM4_ETHERNET_MAC_CHTBAR_AVAILABLE         1
#define FM_ETHERNET_MAC_CHTBAR_AVAILABLE          1
#define FM4_ETHERNET_MAC_CHTDR_AVAILABLE          1
#define FM_ETHERNET_MAC_CHTDR_AVAILABLE           1
#define FM4_ETHERNET_MAC_FCR_AVAILABLE            1
#define FM_ETHERNET_MAC_FCR_AVAILABLE             1
#define FM4_ETHERNET_MAC_GAR_AVAILABLE            1
#define FM_ETHERNET_MAC_GAR_AVAILABLE             1
#define FM4_ETHERNET_MAC_GDR_AVAILABLE            1
#define FM_ETHERNET_MAC_GDR_AVAILABLE             1
#define FM4_ETHERNET_MAC_IER_AVAILABLE            1
#define FM_ETHERNET_MAC_IER_AVAILABLE             1
#define FM4_ETHERNET_MAC_IMR_AVAILABLE            1
#define FM_ETHERNET_MAC_IMR_AVAILABLE             1
#define FM4_ETHERNET_MAC_ISR_AVAILABLE            1
#define FM_ETHERNET_MAC_ISR_AVAILABLE             1
#define FM4_ETHERNET_MAC_LPICSR_AVAILABLE         1
#define FM_ETHERNET_MAC_LPICSR_AVAILABLE          1
#define FM4_ETHERNET_MAC_LPITCR_AVAILABLE         1
#define FM_ETHERNET_MAC_LPITCR_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR0H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR0H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR0L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR0L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR10H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR10H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR10L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR10L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR11H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR11H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR11L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR11L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR12H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR12H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR12L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR12L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR13H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR13H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR13L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR13L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR14H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR14H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR14L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR14L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR15H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR15H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR15L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR15L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR16H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR16H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR16L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR16L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR17H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR17H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR17L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR17L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR18H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR18H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR18L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR18L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR19H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR19H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR19L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR19L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR1H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR1H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR1L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR1L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR20H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR20H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR20L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR20L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR21H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR21H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR21L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR21L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR22H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR22H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR22L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR22L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR23H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR23H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR23L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR23L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR24H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR24H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR24L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR24L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR25H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR25H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR25L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR25L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR26H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR26H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR26L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR26L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR27H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR27H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR27L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR27L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR28H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR28H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR28L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR28L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR29H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR29H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR29L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR29L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR2H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR2H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR2L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR2L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR30H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR30H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR30L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR30L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR31H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR31H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR31L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR31L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR3H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR3H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR3L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR3L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR4H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR4H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR4L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR4L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR5H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR5H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR5L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR5L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR6H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR6H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR6L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR6L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR7H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR7H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR7L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR7L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR8H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR8H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR8L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR8L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR9H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR9H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR9L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR9L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MCR_AVAILABLE            1
#define FM_ETHERNET_MAC_MCR_AVAILABLE             1
#define FM4_ETHERNET_MAC_MFBOCR_AVAILABLE         1
#define FM_ETHERNET_MAC_MFBOCR_AVAILABLE          1
#define FM4_ETHERNET_MAC_MFFR_AVAILABLE           1
#define FM_ETHERNET_MAC_MFFR_AVAILABLE            1
#define FM4_ETHERNET_MAC_MHTRH_AVAILABLE          1
#define FM_ETHERNET_MAC_MHTRH_AVAILABLE           1
#define FM4_ETHERNET_MAC_MHTRL_AVAILABLE          1
#define FM_ETHERNET_MAC_MHTRL_AVAILABLE           1
#define FM4_ETHERNET_MAC_MMC_CNTL_AVAILABLE       1
#define FM_ETHERNET_MAC_MMC_CNTL_AVAILABLE        1
#define FM4_ETHERNET_MAC_MMC_INTR_MASK_RX_AVAILABLE 1
#define FM_ETHERNET_MAC_MMC_INTR_MASK_RX_AVAILABLE 1
#define FM4_ETHERNET_MAC_MMC_INTR_MASK_TX_AVAILABLE 1
#define FM_ETHERNET_MAC_MMC_INTR_MASK_TX_AVAILABLE 1
#define FM4_ETHERNET_MAC_MMC_INTR_RX_AVAILABLE    1
#define FM_ETHERNET_MAC_MMC_INTR_RX_AVAILABLE     1
#define FM4_ETHERNET_MAC_MMC_INTR_TX_AVAILABLE    1
#define FM_ETHERNET_MAC_MMC_INTR_TX_AVAILABLE     1
#define FM4_ETHERNET_MAC_MMC_IPC_INTR_MASK_RX_AVAILABLE 1
#define FM_ETHERNET_MAC_MMC_IPC_INTR_MASK_RX_AVAILABLE 1
#define FM4_ETHERNET_MAC_MMC_IPC_INTR_RX_AVAILABLE 1
#define FM_ETHERNET_MAC_MMC_IPC_INTR_RX_AVAILABLE 1
#define FM4_ETHERNET_MAC_OMR_AVAILABLE            1
#define FM_ETHERNET_MAC_OMR_AVAILABLE             1
#define FM4_ETHERNET_MAC_PMTR_AVAILABLE           1
#define FM_ETHERNET_MAC_PMTR_AVAILABLE            1
#define FM4_ETHERNET_MAC_PPSCR_AVAILABLE          1
#define FM_ETHERNET_MAC_PPSCR_AVAILABLE           1
#define FM4_ETHERNET_MAC_RDLAR_AVAILABLE          1
#define FM_ETHERNET_MAC_RDLAR_AVAILABLE           1
#define FM4_ETHERNET_MAC_RGSR_AVAILABLE           1
#define FM_ETHERNET_MAC_RGSR_AVAILABLE            1
#define FM4_ETHERNET_MAC_RIWTR_AVAILABLE          1
#define FM_ETHERNET_MAC_RIWTR_AVAILABLE           1
#define FM4_ETHERNET_MAC_RPDR_AVAILABLE           1
#define FM_ETHERNET_MAC_RPDR_AVAILABLE            1
#define FM4_ETHERNET_MAC_RWFFR_AVAILABLE          1
#define FM_ETHERNET_MAC_RWFFR_AVAILABLE           1
#define FM4_ETHERNET_MAC_RX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RX128TO255OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RX128TO255OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RX256TO511OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RX256TO511OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RX512TO1023OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RX512TO1023OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RX64OCTETS_GB_AVAILABLE  1
#define FM_ETHERNET_MAC_RX64OCTETS_GB_AVAILABLE   1
#define FM4_ETHERNET_MAC_RX65TO127OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RX65TO127OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXALLIGNMENTERROR_AVAILABLE 1
#define FM_ETHERNET_MAC_RXALLIGNMENTERROR_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXBROADCASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC_RXBROADCASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXCRCERROR_AVAILABLE     1
#define FM_ETHERNET_MAC_RXCRCERROR_AVAILABLE      1
#define FM4_ETHERNET_MAC_RXFIFOOVERFLOW_AVAILABLE 1
#define FM_ETHERNET_MAC_RXFIFOOVERFLOW_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXFRAMECOUNT_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RXFRAMECOUNT_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXICMP_ERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXICMP_ERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXICMP_ERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXICMP_ERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXICMP_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXICMP_GD_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXICMP_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXICMP_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_FRAG_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_FRAG_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_FRAG_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_FRAG_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_GD_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXIPV4_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_HDRERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_HDRERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_HDRERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_HDRERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_NOPAY_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_NOPAY_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_NOPAY_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_NOPAY_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_UDSBL_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_UDSBL_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV4_UDSBL_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV4_UDSBL_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV6_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV6_GD_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXIPV6_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV6_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV6_HDRERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV6_HDRERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV6_HDRERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV6_HDRERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV6_NOPAY_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV6_NOPAY_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXIPV6_NOPAY_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXIPV6_NOPAY_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXJABBERERROR_AVAILABLE  1
#define FM_ETHERNET_MAC_RXJABBERERROR_AVAILABLE   1
#define FM4_ETHERNET_MAC_RXLENGTHERROR_AVAILABLE  1
#define FM_ETHERNET_MAC_RXLENGTHERROR_AVAILABLE   1
#define FM4_ETHERNET_MAC_RXMULTICASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC_RXMULTICASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXOCTETCOUNT_G_AVAILABLE 1
#define FM_ETHERNET_MAC_RXOCTETCOUNT_G_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXOCTETCOUNT_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RXOCTETCOUNT_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXOUTOFRANGETYPE_AVAILABLE 1
#define FM_ETHERNET_MAC_RXOUTOFRANGETYPE_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXOVERSIZE_G_AVAILABLE   1
#define FM_ETHERNET_MAC_RXOVERSIZE_G_AVAILABLE    1
#define FM4_ETHERNET_MAC_RXPAUSEFRAMES_AVAILABLE  1
#define FM_ETHERNET_MAC_RXPAUSEFRAMES_AVAILABLE   1
#define FM4_ETHERNET_MAC_RXRUNTERROR_AVAILABLE    1
#define FM_ETHERNET_MAC_RXRUNTERROR_AVAILABLE     1
#define FM4_ETHERNET_MAC_RXTCP_ERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXTCP_ERR_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXTCP_ERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXTCP_ERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXTCP_GD_FRMS_AVAILABLE  1
#define FM_ETHERNET_MAC_RXTCP_GD_FRMS_AVAILABLE   1
#define FM4_ETHERNET_MAC_RXTCP_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXTCP_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXUDP_ERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXUDP_ERR_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC_RXUDP_ERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXUDP_ERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXUDP_GD_FRMS_AVAILABLE  1
#define FM_ETHERNET_MAC_RXUDP_GD_FRMS_AVAILABLE   1
#define FM4_ETHERNET_MAC_RXUDP_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC_RXUDP_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXUNDERSIZE_G_AVAILABLE  1
#define FM_ETHERNET_MAC_RXUNDERSIZE_G_AVAILABLE   1
#define FM4_ETHERNET_MAC_RXUNICASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC_RXUNICASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXVLANFRAMES_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_RXVLANFRAMES_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_RXWATCHDOGERROR_AVAILABLE 1
#define FM_ETHERNET_MAC_RXWATCHDOGERROR_AVAILABLE 1
#define FM4_ETHERNET_MAC_SR_AVAILABLE             1
#define FM_ETHERNET_MAC_SR_AVAILABLE              1
#define FM4_ETHERNET_MAC_SSIR_AVAILABLE           1
#define FM_ETHERNET_MAC_SSIR_AVAILABLE            1
#define FM4_ETHERNET_MAC_STHWSR_AVAILABLE         1
#define FM_ETHERNET_MAC_STHWSR_AVAILABLE          1
#define FM4_ETHERNET_MAC_STNR_AVAILABLE           1
#define FM_ETHERNET_MAC_STNR_AVAILABLE            1
#define FM4_ETHERNET_MAC_STNUR_AVAILABLE          1
#define FM_ETHERNET_MAC_STNUR_AVAILABLE           1
#define FM4_ETHERNET_MAC_STSR_AVAILABLE           1
#define FM_ETHERNET_MAC_STSR_AVAILABLE            1
#define FM4_ETHERNET_MAC_STSUR_AVAILABLE          1
#define FM_ETHERNET_MAC_STSUR_AVAILABLE           1
#define FM4_ETHERNET_MAC_TDLAR_AVAILABLE          1
#define FM_ETHERNET_MAC_TDLAR_AVAILABLE           1
#define FM4_ETHERNET_MAC_TPDR_AVAILABLE           1
#define FM_ETHERNET_MAC_TPDR_AVAILABLE            1
#define FM4_ETHERNET_MAC_TSAR_AVAILABLE           1
#define FM_ETHERNET_MAC_TSAR_AVAILABLE            1
#define FM4_ETHERNET_MAC_TSCR_AVAILABLE           1
#define FM_ETHERNET_MAC_TSCR_AVAILABLE            1
#define FM4_ETHERNET_MAC_TSR_AVAILABLE            1
#define FM_ETHERNET_MAC_TSR_AVAILABLE             1
#define FM4_ETHERNET_MAC_TTNR_AVAILABLE           1
#define FM_ETHERNET_MAC_TTNR_AVAILABLE            1
#define FM4_ETHERNET_MAC_TTSR_AVAILABLE           1
#define FM_ETHERNET_MAC_TTSR_AVAILABLE            1
#define FM4_ETHERNET_MAC_TX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_TX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_TX128TO255OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_TX128TO255OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_TX256TO511OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_TX256TO511OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_TX512TO1023OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_TX512TO1023OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_TX64OCTETS_GB_AVAILABLE  1
#define FM_ETHERNET_MAC_TX64OCTETS_GB_AVAILABLE   1
#define FM4_ETHERNET_MAC_TX65TO127OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC_TX65TO127OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC_TXBROADCASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC_TXBROADCASTFRAMES_G_AVAILABLE 1
