mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xj/common/s6e2g2xj.h
#define FM_RTC_ALYR_AVAILABLE                     1
#define FM4_RTC_WTBR_AVAILABLE                    1
#define FM_RTC_WTBR_AVAILABLE                     1
#define FM4_RTC_WTCAL_AVAILABLE                   1
#define FM_RTC_WTCAL_AVAILABLE                    1
#define FM4_RTC_WTCALEN_AVAILABLE                 1
#define FM_RTC_WTCALEN_AVAILABLE                  1
#define FM4_RTC_WTCALPRD_AVAILABLE                1
#define FM_RTC_WTCALPRD_AVAILABLE                 1
#define FM4_RTC_WTCLKM_AVAILABLE                  1
#define FM_RTC_WTCLKM_AVAILABLE                   1
#define FM4_RTC_WTCLKS_AVAILABLE                  1
#define FM_RTC_WTCLKS_AVAILABLE                   1
#define FM4_RTC_WTCOSEL_AVAILABLE                 1
#define FM_RTC_WTCOSEL_AVAILABLE                  1
#define FM4_RTC_WTCR1_AVAILABLE                   1
#define FM_RTC_WTCR1_AVAILABLE                    1
#define FM4_RTC_WTCR2_AVAILABLE                   1
#define FM_RTC_WTCR2_AVAILABLE                    1
#define FM4_RTC_WTDIV_AVAILABLE                   1
#define FM_RTC_WTDIV_AVAILABLE                    1
#define FM4_RTC_WTDIVEN_AVAILABLE                 1
#define FM_RTC_WTDIVEN_AVAILABLE                  1
#define FM4_RTC_WTDR_AVAILABLE                    1
#define FM_RTC_WTDR_AVAILABLE                     1
#define FM4_RTC_WTDW_AVAILABLE                    1
#define FM_RTC_WTDW_AVAILABLE                     1
#define FM4_RTC_WTHR_AVAILABLE                    1
#define FM_RTC_WTHR_AVAILABLE                     1
#define FM4_RTC_WTMIR_AVAILABLE                   1
#define FM_RTC_WTMIR_AVAILABLE                    1
#define FM4_RTC_WTMOR_AVAILABLE                   1
#define FM_RTC_WTMOR_AVAILABLE                    1
#define FM4_RTC_WTSR_AVAILABLE                    1
#define FM_RTC_WTSR_AVAILABLE                     1
#define FM4_RTC_WTTR_AVAILABLE                    1
#define FM_RTC_WTTR_AVAILABLE                     1
#define FM4_RTC_WTYR_AVAILABLE                    1
#define FM_RTC_WTYR_AVAILABLE                     1
/*******************************************************************************
* SBSSR
*******************************************************************************/
#define FM4_SBSSR_BTSSSR_AVAILABLE                1
#define FM_SBSSR_BTSSSR_AVAILABLE                 1
/*******************************************************************************
* SMCIF0
*******************************************************************************/
#define FM4_SMCIF_BAUDRATE_AVAILABLE              1
#define FM_SMCIF_BAUDRATE_AVAILABLE               1
#define FM4_SMCIF_CARDCLOCK_AVAILABLE             1
#define FM_SMCIF_CARDCLOCK_AVAILABLE              1
#define FM4_SMCIF_DATA_AVAILABLE                  1
#define FM_SMCIF_DATA_AVAILABLE                   1
#define FM4_SMCIF_DATA_FIFO_AVAILABLE             1
#define FM_SMCIF_DATA_FIFO_AVAILABLE              1
#define FM4_SMCIF_FIFO_CLEAR_MSB_READ_AVAILABLE   1
#define FM_SMCIF_FIFO_CLEAR_MSB_READ_AVAILABLE    1
#define FM4_SMCIF_FIFO_CLEAR_MSB_WRITE_AVAILABLE  1
#define FM_SMCIF_FIFO_CLEAR_MSB_WRITE_AVAILABLE   1
#define FM4_SMCIF_FIFO_LEVEL_READ_AVAILABLE       1
#define FM_SMCIF_FIFO_LEVEL_READ_AVAILABLE        1
#define FM4_SMCIF_FIFO_LEVEL_WRITE_AVAILABLE      1
#define FM_SMCIF_FIFO_LEVEL_WRITE_AVAILABLE       1
#define FM4_SMCIF_FIFO_MODE_AVAILABLE             1
#define FM_SMCIF_FIFO_MODE_AVAILABLE              1
#define FM4_SMCIF_GLOBALCONTROL1_AVAILABLE        1
#define FM_SMCIF_GLOBALCONTROL1_AVAILABLE         1
#define FM4_SMCIF_GLOBALCONTROL2_AVAILABLE        1
#define FM_SMCIF_GLOBALCONTROL2_AVAILABLE         1
#define FM4_SMCIF_GUARDTIMER_AVAILABLE            1
#define FM_SMCIF_GUARDTIMER_AVAILABLE             1
#define FM4_SMCIF_IDLETIMER_AVAILABLE             1
#define FM_SMCIF_IDLETIMER_AVAILABLE              1
#define FM4_SMCIF_IRQ_STATUS_AVAILABLE            1
#define FM_SMCIF_IRQ_STATUS_AVAILABLE             1
#define FM4_SMCIF_PORTCONTROL_AVAILABLE           1
#define FM_SMCIF_PORTCONTROL_AVAILABLE            1
#define FM4_SMCIF_STATUS_AVAILABLE                1
#define FM_SMCIF_STATUS_AVAILABLE                 1
/*******************************************************************************
* SWWDT
*******************************************************************************/
#define FM4_SWWDT_WDOGCONTROL_AVAILABLE           1
#define FM_SWWDT_WDOGCONTROL_AVAILABLE            1
#define FM4_SWWDT_WDOGINTCLR_AVAILABLE            1
#define FM_SWWDT_WDOGINTCLR_AVAILABLE             1
#define FM4_SWWDT_WDOGLOAD_AVAILABLE              1
#define FM_SWWDT_WDOGLOAD_AVAILABLE               1
#define FM4_SWWDT_WDOGLOCK_AVAILABLE              1
#define FM_SWWDT_WDOGLOCK_AVAILABLE               1
#define FM4_SWWDT_WDOGRIS_AVAILABLE               1
#define FM_SWWDT_WDOGRIS_AVAILABLE                1
#define FM4_SWWDT_WDOGSPMC_AVAILABLE              1
#define FM_SWWDT_WDOGSPMC_AVAILABLE               1
#define FM4_SWWDT_WDOGVALUE_AVAILABLE             1
#define FM_SWWDT_WDOGVALUE_AVAILABLE              1
/*******************************************************************************
* UNIQUE_ID
*******************************************************************************/
#define FM4_UNIQUE_ID_UIDR0_AVAILABLE             1
#define FM_UNIQUE_ID_UIDR0_AVAILABLE              1
#define FM4_UNIQUE_ID_UIDR1_AVAILABLE             1
#define FM_UNIQUE_ID_UIDR1_AVAILABLE              1
/*******************************************************************************
* USB0
*******************************************************************************/
#define FM4_USB_EP0C_AVAILABLE                    1
#define FM_USB_EP0C_AVAILABLE                     1
#define FM4_USB_EP0DT_AVAILABLE                   1
#define FM_USB_EP0DT_AVAILABLE                    1
#define FM4_USB_EP0IS_AVAILABLE                   1
#define FM_USB_EP0IS_AVAILABLE                    1
#define FM4_USB_EP0OS_AVAILABLE                   1
#define FM_USB_EP0OS_AVAILABLE                    1
#define FM4_USB_EP1C_AVAILABLE                    1
#define FM_USB_EP1C_AVAILABLE                     1
#define FM4_USB_EP1DT_AVAILABLE                   1
#define FM_USB_EP1DT_AVAILABLE                    1
#define FM4_USB_EP1S_AVAILABLE                    1
#define FM_USB_EP1S_AVAILABLE                     1
#define FM4_USB_EP2C_AVAILABLE                    1
#define FM_USB_EP2C_AVAILABLE                     1
#define FM4_USB_EP2DT_AVAILABLE                   1
#define FM_USB_EP2DT_AVAILABLE                    1
#define FM4_USB_EP2S_AVAILABLE                    1
#define FM_USB_EP2S_AVAILABLE                     1
#define FM4_USB_EP3C_AVAILABLE                    1
#define FM_USB_EP3C_AVAILABLE                     1
#define FM4_USB_EP3DT_AVAILABLE                   1
#define FM_USB_EP3DT_AVAILABLE                    1
#define FM4_USB_EP3S_AVAILABLE                    1
#define FM_USB_EP3S_AVAILABLE                     1
#define FM4_USB_EP4C_AVAILABLE                    1
#define FM_USB_EP4C_AVAILABLE                     1
#define FM4_USB_EP4DT_AVAILABLE                   1
#define FM_USB_EP4DT_AVAILABLE                    1
#define FM4_USB_EP4S_AVAILABLE                    1
#define FM_USB_EP4S_AVAILABLE                     1
#define FM4_USB_EP5C_AVAILABLE                    1
#define FM_USB_EP5C_AVAILABLE                     1
#define FM4_USB_EP5DT_AVAILABLE                   1
#define FM_USB_EP5DT_AVAILABLE                    1
#define FM4_USB_EP5S_AVAILABLE                    1
#define FM_USB_EP5S_AVAILABLE                     1
#define FM4_USB_HADR_AVAILABLE                    1
#define FM_USB_HADR_AVAILABLE                     1
#define FM4_USB_HCNT_AVAILABLE                    1
#define FM_USB_HCNT_AVAILABLE                     1
#define FM4_USB_HEOF_AVAILABLE                    1
#define FM_USB_HEOF_AVAILABLE                     1
#define FM4_USB_HERR_AVAILABLE                    1
#define FM_USB_HERR_AVAILABLE                     1
#define FM4_USB_HFCOMP_AVAILABLE                  1
#define FM_USB_HFCOMP_AVAILABLE                   1
#define FM4_USB_HFRAME_AVAILABLE                  1
#define FM_USB_HFRAME_AVAILABLE                   1
#define FM4_USB_HIRQ_AVAILABLE                    1
#define FM_USB_HIRQ_AVAILABLE                     1
#define FM4_USB_HRTIMER_AVAILABLE                 1
#define FM_USB_HRTIMER_AVAILABLE                  1
#define FM4_USB_HRTIMER2_AVAILABLE                1
#define FM_USB_HRTIMER2_AVAILABLE                 1
#define FM4_USB_HSTATE_AVAILABLE                  1
#define FM_USB_HSTATE_AVAILABLE                   1
#define FM4_USB_HTOKEN_AVAILABLE                  1
#define FM_USB_HTOKEN_AVAILABLE                   1
#define FM4_USB_TMSP_AVAILABLE                    1
#define FM_USB_TMSP_AVAILABLE                     1
#define FM4_USB_UDCC_AVAILABLE                    1
#define FM_USB_UDCC_AVAILABLE                     1
#define FM4_USB_UDCIE_AVAILABLE                   1
#define FM_USB_UDCIE_AVAILABLE                    1
#define FM4_USB_UDCS_AVAILABLE                    1
#define FM_USB_UDCS_AVAILABLE                     1
/*******************************************************************************
* USBETHERCLK
*******************************************************************************/
#define FM4_USBETHERCLK_UCCR_AVAILABLE            1
#define FM_USBETHERCLK_UCCR_AVAILABLE             1
#define FM4_USBETHERCLK_UP_STR_AVAILABLE          1
#define FM_USBETHERCLK_UP_STR_AVAILABLE           1
#define FM4_USBETHERCLK_UPCR1_AVAILABLE           1
#define FM_USBETHERCLK_UPCR1_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR2_AVAILABLE           1
#define FM_USBETHERCLK_UPCR2_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR3_AVAILABLE           1
#define FM_USBETHERCLK_UPCR3_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR4_AVAILABLE           1
#define FM_USBETHERCLK_UPCR4_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR5_AVAILABLE           1
#define FM_USBETHERCLK_UPCR5_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR6_AVAILABLE           1
#define FM_USBETHERCLK_UPCR6_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR7_AVAILABLE           1
#define FM_USBETHERCLK_UPCR7_AVAILABLE            1
#define FM4_USBETHERCLK_UPINT_CLR_AVAILABLE       1
#define FM_USBETHERCLK_UPINT_CLR_AVAILABLE        1
#define FM4_USBETHERCLK_UPINT_ENR_AVAILABLE       1
#define FM_USBETHERCLK_UPINT_ENR_AVAILABLE        1
#define FM4_USBETHERCLK_UPINT_STR_AVAILABLE       1
#define FM_USBETHERCLK_UPINT_STR_AVAILABLE        1
#define FM4_USBETHERCLK_USBEN0_AVAILABLE          1
#define FM_USBETHERCLK_USBEN0_AVAILABLE           1
#define FM4_USBETHERCLK_USBEN1_AVAILABLE          1
#define FM_USBETHERCLK_USBEN1_AVAILABLE           1
/*******************************************************************************
* WC
*******************************************************************************/
#define FM4_WC_CLK_EN_AVAILABLE                   1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM4_WC_CLK_SEL_AVAILABLE                  1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM4_WC_WCCR_AVAILABLE                     1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM4_WC_WCRD_AVAILABLE                     1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM4_WC_WCRL_AVAILABLE                     1
#define FM_WC_WCRL_AVAILABLE                      1

