mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xj/common/s6e2g2xj.h
#define bFM_GPIO_PDOR4_P0                         *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P0                        *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM_GPIO_PDOR4_P1                         *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P1                        *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM_GPIO_PDOR4_P2                         *((volatile  uint8_t *)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P2                        *((volatile  uint8_t *)(0x42DE8208UL))
#define bFM_GPIO_PDOR4_P3                         *((volatile  uint8_t *)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P3                        *((volatile  uint8_t *)(0x42DE820CUL))
#define bFM_GPIO_PDOR4_P4                         *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P4                        *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM_GPIO_PDOR4_P5                         *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P5                        *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM_GPIO_PDOR4_PA                         *((volatile  uint8_t *)(0x42DE8228UL))
#define bFM4_GPIO_PDOR4_PA                        *((volatile  uint8_t *)(0x42DE8228UL))
#define bFM_GPIO_PDOR4_PB                         *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PB                        *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM_GPIO_PDOR4_PC                         *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PC                        *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM_GPIO_PDOR4_PD                         *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PD                        *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM_GPIO_PDOR4_PE                         *((volatile  uint8_t *)(0x42DE8238UL))
#define bFM4_GPIO_PDOR4_PE                        *((volatile  uint8_t *)(0x42DE8238UL))

#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P0                        *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P1                        *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P2                        *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM_GPIO_PDOR5_PD                         *((volatile  uint8_t *)(0x42DE82B4UL))
#define bFM4_GPIO_PDOR5_PD                        *((volatile  uint8_t *)(0x42DE82B4UL))
#define bFM_GPIO_PDOR5_PE                         *((volatile  uint8_t *)(0x42DE82B8UL))
#define bFM4_GPIO_PDOR5_PE                        *((volatile  uint8_t *)(0x42DE82B8UL))
#define bFM_GPIO_PDOR5_PF                         *((volatile  uint8_t *)(0x42DE82BCUL))
#define bFM4_GPIO_PDOR5_PF                        *((volatile  uint8_t *)(0x42DE82BCUL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM_GPIO_PDOR6_P4                         *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P4                        *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM_GPIO_PDOR6_P5                         *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P5                        *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM_GPIO_PDOR6_PE                         *((volatile  uint8_t *)(0x42DE8338UL))
#define bFM4_GPIO_PDOR6_PE                        *((volatile  uint8_t *)(0x42DE8338UL))

#define bFM_GPIO_PDOR7_P0                         *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P0                        *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM_GPIO_PDOR7_P1                         *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P1                        *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM_GPIO_PDOR7_P2                         *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P2                        *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM_GPIO_PDOR7_P3                         *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P3                        *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM_GPIO_PDOR7_P4                         *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P4                        *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM_GPIO_PDOR7_P5                         *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM4_GPIO_PDOR7_P5                        *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM_GPIO_PDOR7_P6                         *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM4_GPIO_PDOR7_P6                        *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM_GPIO_PDOR7_P7                         *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM4_GPIO_PDOR7_P7                        *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM_GPIO_PDOR7_P8                         *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM4_GPIO_PDOR7_P8                        *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM_GPIO_PDOR7_P9                         *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM4_GPIO_PDOR7_P9                        *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM_GPIO_PDOR7_PA                         *((volatile  uint8_t *)(0x42DE83A8UL))
#define bFM4_GPIO_PDOR7_PA                        *((volatile  uint8_t *)(0x42DE83A8UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM_GPIO_PDOR8_P2                         *((volatile  uint8_t *)(0x42DE8408UL))
#define bFM4_GPIO_PDOR8_P2                        *((volatile  uint8_t *)(0x42DE8408UL))
#define bFM_GPIO_PDOR8_P3                         *((volatile  uint8_t *)(0x42DE840CUL))
#define bFM4_GPIO_PDOR8_P3                        *((volatile  uint8_t *)(0x42DE840CUL))

#define bFM_GPIO_PDOR9_P0                         *((volatile  uint8_t *)(0x42DE8480UL))
#define bFM4_GPIO_PDOR9_P0                        *((volatile  uint8_t *)(0x42DE8480UL))
#define bFM_GPIO_PDOR9_P1                         *((volatile  uint8_t *)(0x42DE8484UL))
#define bFM4_GPIO_PDOR9_P1                        *((volatile  uint8_t *)(0x42DE8484UL))
#define bFM_GPIO_PDOR9_P2                         *((volatile  uint8_t *)(0x42DE8488UL))
#define bFM4_GPIO_PDOR9_P2                        *((volatile  uint8_t *)(0x42DE8488UL))
#define bFM_GPIO_PDOR9_P3                         *((volatile  uint8_t *)(0x42DE848CUL))
#define bFM4_GPIO_PDOR9_P3                        *((volatile  uint8_t *)(0x42DE848CUL))
#define bFM_GPIO_PDOR9_P4                         *((volatile  uint8_t *)(0x42DE8490UL))
#define bFM4_GPIO_PDOR9_P4                        *((volatile  uint8_t *)(0x42DE8490UL))
#define bFM_GPIO_PDOR9_P5                         *((volatile  uint8_t *)(0x42DE8494UL))
#define bFM4_GPIO_PDOR9_P5                        *((volatile  uint8_t *)(0x42DE8494UL))

