mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g2xj/common/s6e2g2xj.h
#define bFM_GPIO_PZR8_P0                          *((volatile  uint8_t *)(0x42DEE400UL))
#define bFM4_GPIO_PZR8_P0                         *((volatile  uint8_t *)(0x42DEE400UL))
#define bFM_GPIO_PZR8_P1                          *((volatile  uint8_t *)(0x42DEE404UL))
#define bFM4_GPIO_PZR8_P1                         *((volatile  uint8_t *)(0x42DEE404UL))
#define bFM_GPIO_PZR8_P2                          *((volatile  uint8_t *)(0x42DEE408UL))
#define bFM4_GPIO_PZR8_P2                         *((volatile  uint8_t *)(0x42DEE408UL))
#define bFM_GPIO_PZR8_P3                          *((volatile  uint8_t *)(0x42DEE40CUL))
#define bFM4_GPIO_PZR8_P3                         *((volatile  uint8_t *)(0x42DEE40CUL))

#define bFM_GPIO_PZR9_P0                          *((volatile  uint8_t *)(0x42DEE480UL))
#define bFM4_GPIO_PZR9_P0                         *((volatile  uint8_t *)(0x42DEE480UL))
#define bFM_GPIO_PZR9_P1                          *((volatile  uint8_t *)(0x42DEE484UL))
#define bFM4_GPIO_PZR9_P1                         *((volatile  uint8_t *)(0x42DEE484UL))
#define bFM_GPIO_PZR9_P2                          *((volatile  uint8_t *)(0x42DEE488UL))
#define bFM4_GPIO_PZR9_P2                         *((volatile  uint8_t *)(0x42DEE488UL))
#define bFM_GPIO_PZR9_P3                          *((volatile  uint8_t *)(0x42DEE48CUL))
#define bFM4_GPIO_PZR9_P3                         *((volatile  uint8_t *)(0x42DEE48CUL))
#define bFM_GPIO_PZR9_P4                          *((volatile  uint8_t *)(0x42DEE490UL))
#define bFM4_GPIO_PZR9_P4                         *((volatile  uint8_t *)(0x42DEE490UL))
#define bFM_GPIO_PZR9_P5                          *((volatile  uint8_t *)(0x42DEE494UL))
#define bFM4_GPIO_PZR9_P5                         *((volatile  uint8_t *)(0x42DEE494UL))

#define bFM_GPIO_PZRA_P0                          *((volatile  uint8_t *)(0x42DEE500UL))
#define bFM4_GPIO_PZRA_P0                         *((volatile  uint8_t *)(0x42DEE500UL))
#define bFM_GPIO_PZRA_P1                          *((volatile  uint8_t *)(0x42DEE504UL))
#define bFM4_GPIO_PZRA_P1                         *((volatile  uint8_t *)(0x42DEE504UL))
#define bFM_GPIO_PZRA_P2                          *((volatile  uint8_t *)(0x42DEE508UL))
#define bFM4_GPIO_PZRA_P2                         *((volatile  uint8_t *)(0x42DEE508UL))
#define bFM_GPIO_PZRA_P3                          *((volatile  uint8_t *)(0x42DEE50CUL))
#define bFM4_GPIO_PZRA_P3                         *((volatile  uint8_t *)(0x42DEE50CUL))
#define bFM_GPIO_PZRA_P4                          *((volatile  uint8_t *)(0x42DEE510UL))
#define bFM4_GPIO_PZRA_P4                         *((volatile  uint8_t *)(0x42DEE510UL))
#define bFM_GPIO_PZRA_P5                          *((volatile  uint8_t *)(0x42DEE514UL))
#define bFM4_GPIO_PZRA_P5                         *((volatile  uint8_t *)(0x42DEE514UL))
#define bFM_GPIO_PZRA_P6                          *((volatile  uint8_t *)(0x42DEE518UL))
#define bFM4_GPIO_PZRA_P6                         *((volatile  uint8_t *)(0x42DEE518UL))
#define bFM_GPIO_PZRA_P7                          *((volatile  uint8_t *)(0x42DEE51CUL))
#define bFM4_GPIO_PZRA_P7                         *((volatile  uint8_t *)(0x42DEE51CUL))
#define bFM_GPIO_PZRA_P8                          *((volatile  uint8_t *)(0x42DEE520UL))
#define bFM4_GPIO_PZRA_P8                         *((volatile  uint8_t *)(0x42DEE520UL))
#define bFM_GPIO_PZRA_P9                          *((volatile  uint8_t *)(0x42DEE524UL))
#define bFM4_GPIO_PZRA_P9                         *((volatile  uint8_t *)(0x42DEE524UL))
#define bFM_GPIO_PZRA_PA                          *((volatile  uint8_t *)(0x42DEE528UL))
#define bFM4_GPIO_PZRA_PA                         *((volatile  uint8_t *)(0x42DEE528UL))
#define bFM_GPIO_PZRA_PB                          *((volatile  uint8_t *)(0x42DEE52CUL))
#define bFM4_GPIO_PZRA_PB                         *((volatile  uint8_t *)(0x42DEE52CUL))
#define bFM_GPIO_PZRA_PC                          *((volatile  uint8_t *)(0x42DEE530UL))
#define bFM4_GPIO_PZRA_PC                         *((volatile  uint8_t *)(0x42DEE530UL))
#define bFM_GPIO_PZRA_PD                          *((volatile  uint8_t *)(0x42DEE534UL))
#define bFM4_GPIO_PZRA_PD                         *((volatile  uint8_t *)(0x42DEE534UL))
#define bFM_GPIO_PZRA_PE                          *((volatile  uint8_t *)(0x42DEE538UL))
#define bFM4_GPIO_PZRA_PE                         *((volatile  uint8_t *)(0x42DEE538UL))
#define bFM_GPIO_PZRA_PF                          *((volatile  uint8_t *)(0x42DEE53CUL))
#define bFM4_GPIO_PZRA_PF                         *((volatile  uint8_t *)(0x42DEE53CUL))

#define bFM_GPIO_PZRB_P0                          *((volatile  uint8_t *)(0x42DEE580UL))
#define bFM4_GPIO_PZRB_P0                         *((volatile  uint8_t *)(0x42DEE580UL))
#define bFM_GPIO_PZRB_P1                          *((volatile  uint8_t *)(0x42DEE584UL))
#define bFM4_GPIO_PZRB_P1                         *((volatile  uint8_t *)(0x42DEE584UL))
#define bFM_GPIO_PZRB_P2                          *((volatile  uint8_t *)(0x42DEE588UL))
#define bFM4_GPIO_PZRB_P2                         *((volatile  uint8_t *)(0x42DEE588UL))
#define bFM_GPIO_PZRB_P3                          *((volatile  uint8_t *)(0x42DEE58CUL))
#define bFM4_GPIO_PZRB_P3                         *((volatile  uint8_t *)(0x42DEE58CUL))
#define bFM_GPIO_PZRB_P4                          *((volatile  uint8_t *)(0x42DEE590UL))
#define bFM4_GPIO_PZRB_P4                         *((volatile  uint8_t *)(0x42DEE590UL))
#define bFM_GPIO_PZRB_P5                          *((volatile  uint8_t *)(0x42DEE594UL))
#define bFM4_GPIO_PZRB_P5                         *((volatile  uint8_t *)(0x42DEE594UL))
#define bFM_GPIO_PZRB_P6                          *((volatile  uint8_t *)(0x42DEE598UL))
#define bFM4_GPIO_PZRB_P6                         *((volatile  uint8_t *)(0x42DEE598UL))
#define bFM_GPIO_PZRB_P7                          *((volatile  uint8_t *)(0x42DEE59CUL))
#define bFM4_GPIO_PZRB_P7                         *((volatile  uint8_t *)(0x42DEE59CUL))

#define bFM_GPIO_PZRC_P0                          *((volatile  uint8_t *)(0x42DEE600UL))
#define bFM4_GPIO_PZRC_P0                         *((volatile  uint8_t *)(0x42DEE600UL))
#define bFM_GPIO_PZRC_P1                          *((volatile  uint8_t *)(0x42DEE604UL))
#define bFM4_GPIO_PZRC_P1                         *((volatile  uint8_t *)(0x42DEE604UL))
#define bFM_GPIO_PZRC_P2                          *((volatile  uint8_t *)(0x42DEE608UL))
#define bFM4_GPIO_PZRC_P2                         *((volatile  uint8_t *)(0x42DEE608UL))
#define bFM_GPIO_PZRC_P3                          *((volatile  uint8_t *)(0x42DEE60CUL))
#define bFM4_GPIO_PZRC_P3                         *((volatile  uint8_t *)(0x42DEE60CUL))
#define bFM_GPIO_PZRC_P4                          *((volatile  uint8_t *)(0x42DEE610UL))
#define bFM4_GPIO_PZRC_P4                         *((volatile  uint8_t *)(0x42DEE610UL))
#define bFM_GPIO_PZRC_P5                          *((volatile  uint8_t *)(0x42DEE614UL))
#define bFM4_GPIO_PZRC_P5                         *((volatile  uint8_t *)(0x42DEE614UL))
#define bFM_GPIO_PZRC_P6                          *((volatile  uint8_t *)(0x42DEE618UL))
#define bFM4_GPIO_PZRC_P6                         *((volatile  uint8_t *)(0x42DEE618UL))
#define bFM_GPIO_PZRC_P7                          *((volatile  uint8_t *)(0x42DEE61CUL))
#define bFM4_GPIO_PZRC_P7                         *((volatile  uint8_t *)(0x42DEE61CUL))
#define bFM_GPIO_PZRC_P8                          *((volatile  uint8_t *)(0x42DEE620UL))
#define bFM4_GPIO_PZRC_P8                         *((volatile  uint8_t *)(0x42DEE620UL))
#define bFM_GPIO_PZRC_P9                          *((volatile  uint8_t *)(0x42DEE624UL))
#define bFM4_GPIO_PZRC_P9                         *((volatile  uint8_t *)(0x42DEE624UL))
#define bFM_GPIO_PZRC_PA                          *((volatile  uint8_t *)(0x42DEE628UL))
#define bFM4_GPIO_PZRC_PA                         *((volatile  uint8_t *)(0x42DEE628UL))
#define bFM_GPIO_PZRC_PB                          *((volatile  uint8_t *)(0x42DEE62CUL))
#define bFM4_GPIO_PZRC_PB                         *((volatile  uint8_t *)(0x42DEE62CUL))
#define bFM_GPIO_PZRC_PC                          *((volatile  uint8_t *)(0x42DEE630UL))
#define bFM4_GPIO_PZRC_PC                         *((volatile  uint8_t *)(0x42DEE630UL))
#define bFM_GPIO_PZRC_PD                          *((volatile  uint8_t *)(0x42DEE634UL))
#define bFM4_GPIO_PZRC_PD                         *((volatile  uint8_t *)(0x42DEE634UL))
#define bFM_GPIO_PZRC_PE                          *((volatile  uint8_t *)(0x42DEE638UL))
#define bFM4_GPIO_PZRC_PE                         *((volatile  uint8_t *)(0x42DEE638UL))
#define bFM_GPIO_PZRC_PF                          *((volatile  uint8_t *)(0x42DEE63CUL))
#define bFM4_GPIO_PZRC_PF                         *((volatile  uint8_t *)(0x42DEE63CUL))

#define bFM_GPIO_PZRD_P0                          *((volatile  uint8_t *)(0x42DEE680UL))
#define bFM4_GPIO_PZRD_P0                         *((volatile  uint8_t *)(0x42DEE680UL))
#define bFM_GPIO_PZRD_P1                          *((volatile  uint8_t *)(0x42DEE684UL))
#define bFM4_GPIO_PZRD_P1                         *((volatile  uint8_t *)(0x42DEE684UL))
#define bFM_GPIO_PZRD_P2                          *((volatile  uint8_t *)(0x42DEE688UL))
#define bFM4_GPIO_PZRD_P2                         *((volatile  uint8_t *)(0x42DEE688UL))

